﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81216SECSetup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_F81216SEC_SIO_FORM                        #language eng "F81216SEC Super IO Configuration"
#string STR_F81216SEC_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_F81216SEC_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_F81216SEC                                 #language eng "F81216SEC"
//
//Serial 1/2/3/4/5/6 Settings
//
//Below are possible resource setting for all serial port
#string STR_F81216SEC_SERIAL1_FORM                    #language eng "Serial Port 1 Configuration"
#string STR_F81216SEC_SERIAL1_FORM_HELP               #language eng "Set Parameters of Serial Port 1 (COMA)"
#string STR_F81216SEC_SERIAL2_FORM                    #language eng "Serial Port 2 Configuration"
#string STR_F81216SEC_SERIAL2_FORM_HELP               #language eng "Set Parameters of Serial Port 2 (COMB)"
#string STR_F81216SEC_SERIAL3_FORM                    #language eng "Serial Port 3 Configuration"
#string STR_F81216SEC_SERIAL3_FORM_HELP               #language eng "Set Parameters of Serial Port 3 (COMC)"
#string STR_F81216SEC_SERIAL4_FORM                    #language eng "Serial Port 4 Configuration"
#string STR_F81216SEC_SERIAL4_FORM_HELP               #language eng "Set Parameters of Serial Port 4 (COMD)"
#string STR_F81216SEC_SERIAL_PROMPT                   #language eng "Serial Port"
#string STR_F81216SEC_SERIAL_PROMPT_HELP              #language eng "Enable or Disable Serial Port (COM)"

#string STR_F81216SEC_SERIAL1_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL2_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL3_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL4_CONFIG_VALUE            #language eng "Reset Required"

#string STR_F81216SEC_SERIAL1_SETTINGS1               #language eng "IO=240h; IRQ=7;"
#string STR_F81216SEC_SERIAL2_SETTINGS1               #language eng "IO=248h; IRQ=7;"
#string STR_F81216SEC_SERIAL3_SETTINGS1               #language eng "IO=250h; IRQ=7;"
#string STR_F81216SEC_SERIAL4_SETTINGS1               #language eng "IO=258h; IRQ=7;"
#string STR_F81216SEC_SERIAL_SETTINGS2                #language eng "IO=240h; IRQ=3,4,5,6,7,10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS3                #language eng "IO=248h; IRQ=3,4,5,6,7,10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS4                #language eng "IO=250h; IRQ=3,4,5,6,7,10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS5                #language eng "IO=258h; IRQ=3,4,5,6,7,10,11,12;"

//
//COMA Settings
//
#string STR_F81216SEC_COMA1_MODE1                      #language eng "Standard Serial Port Mode"
#string STR_F81216SEC_COMA1_MODE2                      #language eng "IrDA Active pulse 1.6 uS,Full Duplex"
#string STR_F81216SEC_COMA1_MODE3                      #language eng "IrDA Active pulse 1.6 uS,Half Duplex"
#string STR_F81216SEC_COMA1_MODE4                      #language eng "IrDA Active pulse 3/16 bit time,Full Duplex"
#string STR_F81216SEC_COMA1_MODE5                      #language eng "IrDA Active pulse 3/16 bit time,Half Duplex"    
//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
